#language: ru

@tree

Функционал: Проверка расчета суммы документа Заказ при изменении количества и цены

Как Менеджер по закупкам я хочу
Проверить расчет суммы документа Заказ  

Контекст:
Дано Я открыл новый сеанс TestClient или подключил уже существующий

Сценарий: Проверка расчета суммы документа Заказ
* Открываем заказ
	И В командном интерфейсе я выбираю 'Продажи' 'Заказы'
	Тогда открылось окно 'Заказы товаров'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно 'Заказ (создание)'
* Номер
	И я запоминаю значение поля "Сумма (итог)" как "$СуммаДокументаДо$"
* Добавляем строку и выбираем номенклатуру
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
	Тогда открылось окно 'Товары'
	И в таблице  "Список" я перехожу на один уровень вниз
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000006' | 'Ботинки'      |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Заказ (создание) *'
* Меняем количество и цену
	И в таблице "Товары" я активизирую поле с именем "ТоварыЦена"
	И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '15,00'
	И я перехожу к следующему реквизиту
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '20'
	И я перехожу к следующему реквизиту
	И я запоминаю значение поля "Сумма (итог)" как "$СуммаДокументаПосле$"
	И переменная "$СуммаДокументаПосле$" имеет значение "300"
	
	  
* Закрываем документ
	И Я закрываю окно 'Заказ (создание) *'
	Тогда открылось окно '1С:Предприятие'
	И я нажимаю на кнопку с именем 'Button1'
	


