#language: ru

@tree

Функционал: Проверка заполнения полей Партнер, Соглашение, Контрагент в документе Заказ покупателя

Как <Роль> я хочу
<описание функционала> 
чтобы <бизнес-эффект>   

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Проверка заполнения полей Партнер, Соглашение, Контрагент в документе Заказ покупателя
*Создание документа
	И В командном интерфейсе я выбираю 'Продажи' 'Заказы покупателей'
	Тогда открылось окно 'Заказы покупателей'
	И я нажимаю на кнопку с именем 'FormCreate'
*Выбор партнера
	Тогда открылось окно 'Заказ покупателя (создание)'
	И я нажимаю кнопку выбора у поля с именем "Partner"
	Тогда открылось окно 'Партнеры'
	И в таблице "List" я перехожу к строке:
		| 'Код' | 'Наименование'            |
		| '2'   | 'Клиент 2 (2 соглашения)' |
	И в таблице "List" я активизирую поле с именем "Description"
	И в таблице "List" я выбираю текущую строку

*Проверка, что контрагент доступен
	И элемент формы "Контрагент" доступен

*Выбор соглашения
Тогда открылось окно 'Заказ покупателя (создание) *'
И в таблице "ItemList" я активизирую поле с именем "ItemListLineNumber"
И я нажимаю кнопку выбора у поля с именем "Agreement"
Тогда открылось окно 'Соглашения'
И в таблице "List" я перехожу к строке:
	| 'Вид'     | 'Вид взаиморасчетов' | 'Код' | 'Наименование'                                        |
	| 'Обычное' | 'По соглашениям'     | '3'   | 'Индивидуальное соглашение 2 (расчет по соглашениям)' |
И в таблице "List" я выбираю текущую строку
Тогда открылось окно 'Заказ покупателя (создание) *'

*Удаление партнера и проверка, что контрагент недоступен
	Когда открылось окно 'Заказ покупателя (создание) *'
	И я нажимаю кнопку очистить у поля с именем "Partner"
	И элемент формы "Контрагент" не доступен

*Закрытие формы
	Когда открылось окно 'Заказ покупателя (создание) *'
	И Я закрываю окно 'Заказ покупателя (создание) *'
	Тогда открылось окно '1С:Предприятие'
	И я нажимаю на кнопку с именем 'Button1'
	Тогда открылось окно 'Заказы покупателей'
	И Я закрываю окно 'Заказы покупателей'
	

	
	
	
