#language: ru

@tree

Функционал: Полная проверка документа Продажа товара

Контекст:
	Дано Я запускаю сценарий открытия TestClient или подключаю уже существующий

Сценарий: Полная проверка документа Продажа товара
*Создание документа
	И В командном интерфейсе я выбираю 'Продажи' 'Продажи'
	Тогда открылось окно 'Продажи товара'
	И я нажимаю на кнопку с именем 'ФормаСоздать'
	Тогда открылось окно 'Продажа товара (создание)'
*Первичное заполнение документа
	И из выпадающего списка с именем "ВидЦен" я выбираю точное значение 'Закупочная'
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "1000 мелочей"'
	И я нажимаю кнопку выбора у поля с именем "Покупатель"
	Тогда открылось окно 'Контрагенты'
	И я нажимаю на кнопку с именем 'ФормаСписок'
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование'    |
		| '000000015' | 'Магазин "Обувь"' |
		И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Продажа товара (создание) *'
	И из выпадающего списка с именем "Склад" я выбираю точное значение 'Средний'
	Когда открылось окно 'Продажа товара (создание) *'
//	И я перехожу к закладке с именем "Прочее"
//	И в поле с именем 'ОбоснованиеОтгрузки' я ввожу текст 'Проверка текстового поля'
//	И я перехожу к закладке с именем "ГруппаТовары"
	
*Заполнение табличной части товаром
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
	Тогда открылось окно 'Товары'
	И я нажимаю на кнопку с именем 'ФормаСписок'
	И в таблице "Список" я перехожу к строке:
		| 'Артикул' | 'Код'       | 'Наименование' |
		| 'ОБ-003'  | '000000006' | 'Ботинки'      |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Продажа товара (создание) *'
	И элемент формы "Количество" доступен
	И в таблице "Товары" я активизирую поле с именем "ТоварыКоличество"
	И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '3,00'	
	И в таблице "Товары" я завершаю редактирование строки
	И в таблице "Товары" я активизирую поле с именем "ТоварыЦена"
	И в таблице "Товары" я выбираю текущую строку
	И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '100,00'
	И в таблице "Товары" я завершаю редактирование строки
*Заполнение табличной части услугой
	И в таблице "Товары" я нажимаю на кнопку с именем 'ТоварыДобавить'
	И в таблице "Товары" я нажимаю кнопку выбора у реквизита с именем "ТоварыТовар"
	Тогда открылось окно 'Товары'
	И в таблице "Список" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000037' | 'Доставка'     |
	И в таблице "Список" я выбираю текущую строку
	Тогда открылось окно 'Продажа товара (создание) *'
	И в таблице "Товары" я активизирую поле с именем "ТоварыЦена"
	И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '100,00'
	И	Проверяю шаги на Исключение:
				|'И в таблице "Товары" в поле с именем 'ТоварыКоличество' я ввожу текст '3,00''|
	И в таблице "Товары" я завершаю редактирование строки

*Проверка подбора
	И в таблице "Товары" я нажимаю на кнопку с именем 'КомандаПодбор'
	Тогда открылось окно 'Подбор товара'
	И в таблице "СписокТоваров" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000011' | 'Продукты'     |
	И в таблице  "СписокТоваров" я перехожу на один уровень вниз
	И в таблице "СписокТоваров" я перехожу к строке:
		| 'Код'       | 'Наименование' |
		| '000000030' | 'Колбаса'      |
	И в таблице "СписокТоваров" я выбираю текущую строку
	И я нажимаю на кнопку с именем 'ОК'


		
*Проверка удаления строки
	Тогда открылось окно 'Продажа товара (создание) *'
	И в таблице "Товары" я перехожу к строке:
		| 'N' | 'Количество' | 'Товар'   |
		| '3' | '1,00'       | 'Колбаса' |
	И в таблице 'Товары' я удаляю строку
	
*Проверка данных в подвале
	И элемент формы "Количество (итог)" стал равен "4"
	И элемент формы "Сумма (итог)" стал равен "400"

*Проверка изменения вида цен
	И из выпадающего списка с именем "ВидЦен" я выбираю точное значение 'Розничная'
	Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'    | 'Цена'     | 'Количество' | 'Сумма'    |
		| '1' | 'Ботинки'  | '2 500,00' | '3,00'       | '7 500,00' |
		| '2' | 'Доставка' | '300,00'   | ''           | '300,00'   |

	И из выпадающего списка с именем "ВидЦен" я выбираю точное значение 'Мелкооптовая'
	Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'    | 'Цена'     | 'Количество' | 'Сумма'    |
		| '1' | 'Ботинки'  | '2 300,00' | '3,00'       | '6 900,00' |
		| '2' | 'Доставка' | '250,00'   | ''           | '250,00'   |
	И из выпадающего списка с именем "ВидЦен" я выбираю точное значение 'Оптовая'
	Тогда таблица "Товары" стала равной:
		| 'N' | 'Товар'    | 'Цена'     | 'Количество' | 'Сумма'    |
		| '1' | 'Ботинки'  | '2 100,00' | '3,00'       | '6 300,00' |
		| '2' | 'Доставка' | '200,00'   | ''           | '200,00'   |
	И из выпадающего списка с именем "ВидЦен" я выбираю точное значение 'Закупочная'
	
	И в таблице "Товары" я перехожу к строке:
		| 'N' | 'Сумма'  | 'Товар'    | 'Цена'   |
		| '2' | '' | 'Доставка' | '' |
	И в таблице "Товары" я выбираю текущую строку
	И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '100,00'
	И в таблице "Товары" я завершаю редактирование строки
		
	И в таблице "Товары" я перехожу к строке:
		| 'N' | 'Количество' | 'Сумма'    | 'Товар'   | 'Цена'     |
		| '1' | '3,00'       | '6 000,00' | 'Ботинки' | '2 000,00' |
	И в таблице "Товары" я выбираю текущую строку
	И в таблице "Товары" в поле с именем 'ТоварыЦена' я ввожу текст '100,00'
	И в таблице "Товары" я завершаю редактирование строки

*Проверка выбора организации с валютой учета
	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "Товары"'
	И элемент формы с именем "Валюта" присутствует на форме
	И из выпадающего списка с именем "Валюта" я выбираю точное значение 'USD'
	И из выпадающего списка с именем "Валюта" я выбираю точное значение 'Рубли'

	И из выпадающего списка с именем "Организация" я выбираю точное значение 'ООО "1000 мелочей"'
	И элемент формы с именем "Валюта" отсутствует на форме
		

*Запись и проведение документа
	И я нажимаю на кнопку с именем 'ФормаЗаписать'
	Тогда открылось окно 'Продажа * от *'
	И я нажимаю на кнопку с именем 'ФормаПровести'
	Тогда открылось окно 'Продажа * от *'

*Проверка печатной формы
	И я нажимаю на кнопку с именем 'ФормаДокументРасходТовараПечатьРасходнойНакладной'
	Тогда открылось окно 'Таблица'
	Тогда табличный документ "SpreadsheetDocument" равен по шаблону:
		| 'Расход товара' | ''                              | ''           | ''      |
		| ''              | ''                              | ''           | ''      |
		| 'Номер'         | '*'                             | ''           | ''      |
		| 'Дата'          | '*'                             | ''           | ''      |
		| 'Покупатель'    | 'Животноводство ООО '           | ''           | ''      |
		| 'Склад'         | 'Средний'                       | ''           | ''      |
		| 'Сумма'         | '400 рублей (Четыреста рублей)' | ''           | ''      |
		| 'Вес'           | ''                              | ''           | ''      |
		| ''              | ''                              | ''           | ''      |
		| 'Товар'         | 'Цена'                          | 'Количество' | 'Сумма' |
		| 'Ботинки'       | '100'                           | '3'          | '300'   |
		| 'Доставка'      | '100'                           | '1'          | '100'   |
	И я закрываю текущее окно
*Проверка движений
	Когда открылось окно 'Продажа * от *'
	И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр взаиморасчетов с контрагентами'
	Тогда таблица "Список" стала равной по шаблону:
		| 'Период' | 'Регистратор' | 'Номер строки' | 'Контрагент'          | 'Сумма'  | 'Валюта' |
		| '*'      | '*'           | '1'            | 'Животноводство ООО ' | '400,00' | 'Рубли'       |
	
	И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр продаж'
	Тогда таблица "Список" стала равной по шаблону:
		| 'Период' | 'Регистратор' | 'Номер строки' | 'Покупатель'          | 'Товар'    | 'Количество' | 'Сумма'  |
		| '*'      | '*'           | '1'            | 'Животноводство ООО ' | 'Ботинки'  | '3,00'       | '300,00' |
		| '*'      | '*'           | '2'            | 'Животноводство ООО ' | 'Доставка' | '1,00'       | '100,00' |
		
	И В текущем окне я нажимаю кнопку командного интерфейса 'Регистр товарных запасов'
	Тогда таблица "Список" стала равной по шаблону:
		| 'Период' | 'Регистратор' | 'Номер строки' | 'Товар'   | 'Склад'   | 'Количество' |
		| '*'      | '*'           | '1'            | 'Ботинки' | 'Средний' | '3,00'       |
	И В текущем окне я нажимаю кнопку командного интерфейса 'Основное'

*Пометка на удаление и закрытие документа
	И я нажимаю на кнопку с именем 'ФормаУстановитьПометкуУдаления'
	Тогда открылось окно '1С:Предприятие'
	И я нажимаю на кнопку с именем 'Button0'
	Тогда открылось окно 'Продажа * от *'
	И Я закрываю окно 'Продажа * от *'
		
	














